#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
aws_vpc.vpc_fiap: Refreshing state... [id=vpc-0ca3300e837ac65ed]
aws_iam_role.cluster: Refreshing state... [id=eks-cluster-role]
aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy: Refreshing state... [id=eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
aws_subnet.subnet_public[1]: Refreshing state... [id=subnet-0dbee360e79feaabe]
aws_subnet.subnet_public[0]: Refreshing state... [id=subnet-06e1721c47d0cc5dc]
aws_subnet.subnet_public[2]: Refreshing state... [id=subnet-076d1d3d0a35d88ee]
aws_internet_gateway.igw: Refreshing state... [id=igw-02024ac4b4f93d682]
aws_security_group.sg: Refreshing state... [id=sg-00ea72bb88c929b8c]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_security_group.sg has been deleted
  - resource "aws_security_group" "sg" {
      - id                     = "sg-00ea72bb88c929b8c" -> null
        name                   = "spoo-ent9-backend -sg"
        tags                   = {}
        # (10 unchanged attributes hidden)
    }

  # aws_subnet.subnet_public[0] has been deleted
  - resource "aws_subnet" "subnet_public" {
      - id                                             = "subnet-06e1721c47d0cc5dc" -> null
        tags                                           = {
            "Name" = "fiap-terraform-aula"
        }
        # (21 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + compute_config            = (known after apply)
      + created_at                = (known after apply)
      + deletion_protection       = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + region                    = (known after apply)
      + remote_network_config     = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + storage_config            = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
      + zonal_shift_config        = (known after apply)
    }

  # data.aws_eks_cluster_auth.auth will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "auth" {
      + id     = (known after apply)
      + name   = (known after apply)
      + region = (known after apply)
      + token  = (sensitive value)
    }

  # aws_eks_access_entry.access_entry will be created
  + resource "aws_eks_access_entry" "access_entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-spoo-ent9-backend"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "group-2",
          + "group-Camilarspoo",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::579375260812:user/camila"
      + region            = "us-east-1"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_entry.app_deploy_actions_access will be created
  + resource "aws_eks_access_entry" "app_deploy_actions_access" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-spoo-ent9-backend"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::579375260812:role/GitHubAction-AppDeploy-Role"
      + region            = "us-east-1"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_entry.infra_actions_access will be created
  + resource "aws_eks_access_entry" "infra_actions_access" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-spoo-ent9-backend"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::579375260812:role/GitHubActionRole-DatabaseInfra"
      + region            = "us-east-1"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.access_entry_association will be created
  + resource "aws_eks_access_policy_association" "access_entry_association" {
      + associated_at = (known after apply)
      + cluster_name  = "eks-spoo-ent9-backend"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSAdminViewPolicy"
      + principal_arn = "arn:aws:iam::579375260812:user/camila"
      + region        = "us-east-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_access_policy_association.app_deploy_actions_admin_policy will be created
  + resource "aws_eks_access_policy_association" "app_deploy_actions_admin_policy" {
      + associated_at = (known after apply)
      + cluster_name  = "eks-spoo-ent9-backend"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::579375260812:role/GitHubAction-AppDeploy-Role"
      + region        = "us-east-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_access_policy_association.infra_actions_admin_policy will be created
  + resource "aws_eks_access_policy_association" "infra_actions_admin_policy" {
      + associated_at = (known after apply)
      + cluster_name  = "eks-spoo-ent9-backend"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::579375260812:role/GitHubActionRole-DatabaseInfra"
      + region        = "us-east-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_cluster.cluster will be created
  + resource "aws_eks_cluster" "cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "eks-spoo-ent9-backend"
      + platform_version              = (known after apply)
      + region                        = "us-east-1"
      + role_arn                      = "arn:aws:iam::579375260812:role/eks-cluster-role"
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = "1.31"

      + access_config {
          + authentication_mode = "API"
        }

      + compute_config (known after apply)

      + kubernetes_network_config (known after apply)

      + storage_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node will be created
  + resource "aws_eks_node_group" "node" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "eks-spoo-ent9-backend"
      + disk_size              = 50
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "nodeg-spoo-ent9-backend"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + region                 = "us-east-1"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 2
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_role.node will be created
  + resource "aws_iam_role" "node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-node-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.node-AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "node-AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-node-group-role"
    }

  # aws_iam_role_policy_attachment.node-AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "node-AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-node-group-role"
    }

  # aws_iam_role_policy_attachment.node-AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "node-AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-node-group-role"
    }

  # aws_route_table.rt_public will be created
  + resource "aws_route_table" "rt_public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = "igw-02024ac4b4f93d682"
                # (11 unchanged attributes hidden)
            },
          + {
              + cidr_block                 = "10.0.0.0/16"
              + gateway_id                 = "local"
                # (11 unchanged attributes hidden)
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = "vpc-0ca3300e837ac65ed"
    }

  # aws_route_table_association.rt_association_0 will be created
  + resource "aws_route_table_association" "rt_association_0" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.rt_association_1 will be created
  + resource "aws_route_table_association" "rt_association_1" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0dbee360e79feaabe"
    }

  # aws_route_table_association.rt_association_2 will be created
  + resource "aws_route_table_association" "rt_association_2" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-076d1d3d0a35d88ee"
    }

  # aws_s3_bucket.spoobucket-aula will be created
  + resource "aws_s3_bucket" "spoobucket-aula" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "spoo-ent9-backend"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Production"
          + "Name"        = "tfstate"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + tags_all                    = {
          + "Environment" = "Production"
          + "Name"        = "tfstate"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "Usado para expor services na internet"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "all"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "spoo-ent9-backend -sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0ca3300e837ac65ed"
    }

  # aws_subnet.subnet_public[0] will be created
  + resource "aws_subnet" "subnet_public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name" = "fiap-terraform-aula"
        }
      + tags_all                                       = {
          + "Name" = "fiap-terraform-aula"
        }
      + vpc_id                                         = "vpc-0ca3300e837ac65ed"
    }

  # kubectl_manifest.namespace will be created
  + resource "kubectl_manifest" "namespace" {
      + api_version             = "v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Namespace"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "nginx"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              name: nginx
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_cidr = [
      + "10.0.0.0/20",
      + "10.0.16.0/20",
      + "10.0.32.0/20",
    ]
  + subnet_id   = [
      + (known after apply),
      + "subnet-0dbee360e79feaabe",
      + "subnet-076d1d3d0a35d88ee",
    ]
  + vpc_cidr    = "10.0.0.0/16"
  + vpc_id      = "vpc-0ca3300e837ac65ed"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pusher: @2rspoo, Action: `pull_request`*